RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/hardware/ef_data_reg.h
    /* 0x7C : EF_DATA_lock */
    union {
        struct
        {
            uint32_t ef_ana_trim_1        : 13; /* [12: 0],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4_l : 1;  /* [   13],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5_l : 1;  /* [   14],        r/w,        0x0 */
            uint32_t wr_lock_boot_mode    : 1;  /* [   15],        r/w,        0x0 */
            uint32_t wr_lock_dbg_pwd      : 1;  /* [   16],        r/w,        0x0 */
            uint32_t wr_lock_sw_usage_0   : 1;  /* [   17],        r/w,        0x0 */
            uint32_t wr_lock_wifi_mac     : 1;  /* [   18],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_0   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_1   : 1;  /* [   20],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_2   : 1;  /* [   21],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_3   : 1;  /* [   22],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_4_h : 1;  /* [   23],        r/w,        0x0 */
            uint32_t wr_lock_key_slot_5_h : 1;  /* [   24],        r/w,        0x0 */
            uint32_t rd_lock_dbg_pwd      : 1;  /* [   25],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_0   : 1;  /* [   26],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_1   : 1;  /* [   27],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_2   : 1;  /* [   28],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_3   : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_4   : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rd_lock_key_slot_5   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } EF_DATA_lock;
};

typedef volatile struct EF_DATA_reg EF_DATA_reg_t;

#endif /* __EF_DATA_REG_H__ */
